In [36]:
import pandas as pd

In [37]:
exam = {'이름' : [ '마징가', '배트맨', '홍길동','임꺽정'],
'국어' : [ 98, 79, 70, 60],
'미술' : [ 78, 89, 95, 80],
'수학' : [ 85, 95, 19, 70],
'체육' : [ 85, 60, 70, 50]}

In [38]:
examDF=pd.DataFrame(exam)

In [39]:
examDF

    이름  국어  미술  수학  체육
0  마징가  98  78  85  85
1  배트맨  79  89  95  60
2  홍길동  70  95  19  70
3  임꺽정  60  80  70  50

In [40]:
examDF.loc[4]=['마징가',98,50,60,77]

In [41]:
examDF.loc[5]=['마징가', 98,87,77,91]

In [42]:
examDF

    이름  국어  미술  수학  체육
0  마징가  98  78  85  85
1  배트맨  79  89  95  60
2  홍길동  70  95  19  70
3  임꺽정  60  80  70  50
4  마징가  98  50  60  77
5  마징가  98  87  77  91

In [43]:
examDF1=examDF.set_index(["이름","국어","수학"])
examDF1

           미술  체육
이름  국어 수학
마징가 98 85  78  85
배트맨 79 95  89  60
홍길동 70 19  95  70
임꺽정 60 70  80  50
마징가 98 60  50  77
       77  87  91

In [44]:
examDF1.xs(98, level=1)

        미술  체육
이름  수학
마징가 85  78  85
    60  50  77
    77  87  91

In [45]:
examDF1.xs(60, level=2)

        미술  체육
이름  국어
마징가 98  50  77

- 행 데이터 선택: DF객체변수명.loc[행레이블]/DF객체변수명.iloc(위치인덱스)

In [46]:
examDF1.loc[('마징가' , 98, 60)]

미술    50
체육    77
Name: (마징가, 98, 60), dtype: int64

In [47]:
# keyerror 발생 ==> ('마징가' , 98, 77)
# examDF1.loc[(98)]

-멀티인덱스의 인덱스 일부분을 기준으로 행 선택 : xs()
    * 예) '마징가' 98 77 => Level 0 1 2

In [49]:
examDF1.loc[  [('마징가', 98, 77 ),] ]

           미술  체육
이름  국어 수학
마징가 98 77  87  91

-(5) 인덱스 재배치 : 행/열 인덱스를 원하는 순서대로 재배치 + 존재하지 않는 행/열 추가
    * DF.reindex()

In [52]:
print(examDF.index, examDF.columns, sep='\n\n')

Index([0, 1, 2, 3, 4, 5], dtype='int64')

Index(['이름', '국어', '미술', '수학', '체육'], dtype='object')

    *컬럼명 순서 변경 ==> '체육','미술','국어','수학'

In [55]:
examDF.reindex(['체육','미술','국어','수학','총합'], axis='columns',fill_value=0)

   체육  미술  국어  수학  총합
0  85  78  98  85   0
1  60  89  79  95   0
2  70  95  70  19   0
3  50  80  60  70   0
4  77  50  98  60   0
5  91  87  98  77   0

In [56]:
examDF.reindex([0,2,4,1,3,5], axis='index',fill_value=0)

    이름  국어  미술  수학  체육
0  마징가  98  78  85  85
2  홍길동  70  95  19  70
4  마징가  98  50  60  77
1  배트맨  79  89  95  60
3  임꺽정  60  80  70  50
5  마징가  98  87  77  91

*컬럼명 순서 변경 ==> '체육','미술','국어','수학','총합' + '행인덱스' => 0,2,4,1,3,5 재배치

In [57]:
examDF.reindex(index=[0,2,4,1,3,5], columns=['체육','미술','국어','수학','총합'],fill_value=0)

   체육  미술  국어  수학  총합
0  85  78  98  85   0
2  70  95  70  19   0
4  77  50  98  60   0
1  60  89  79  95   0
3  50  80  60  70   0
5  91  87  98  77   0